Repository: thinktecture-labs/article-blazor-forms
Catalog: Blazor.FormSample.Web/Shared/ResourceFiles/Resource.*.resx
Languages: de

# Title
source: Forms in Action.
de: Forms in Aktion

# StartDateError
source: The start date must be in the future.
de: Das Datum muss in der Zukunft liegen.

# EndDateErrorOne
source: End Date must be set.
de: Bitte geben Sie ein Abreise Datum an.

# EndDateErrorTwo
source: End Date must be greater than the start date.
de: Das Abreise Datum muss nach dem Startdatum liegen.

# TravelClassError
source: If more than two people are traveling, the travel class must be min. business.
de: Wenn mehr als zwei Personen mitfliegen, muss die Reiseklasse min. Business sein.

# AirportError
source: The departure airport must not be the same as the arrival airport.
de: Der Ablufhafen darf nicht der gleiche wie der Ankunfts Flughafen sein.

# FirstNameRequired
source: First name is required.
de: Bitte geben Sie einen Vornamen an.

# LastNameRequired
source: Last name is required.
de: Bitte geben Sie einen Nachnamen an.

# BirthDateRequired
source: Birthdate is required.
de: Bitte geben Sie ihr Geburtsdatum an.

# FirstNameLength
source: The first name should not have more than 100 characters.
de: Der Vorname sollte nicht mehr als 100 zeichen haben.

# LastNameLength
source: The last name should not have more than 100 characters.
de: Der Vorname sollte nicht mehr als 100 zeichen haben.
